tap "go-task/tap"
tap "goles/battery"
tap "hpedrorodrigues/tools"
tap "hashicorp/tap"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# BLAKE2 b2sum reference binary
brew "b2sum"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Static code checker for C++
brew "cpplint"
# Load/unload environment variables based on $PWD
brew "direnv"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Modern replacement for 'ls'
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU multiple precision arithmetic library
brew "gmp"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Libpcap-based NetFlow probe
brew "fprobe"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# GitHub CLI
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Simple terminal UI for git commands
brew "lazygit"
# ELF object file access library
brew "libelf"
# Next-gen compiler infrastructure
brew "llvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Python dependency management tool
brew "pipenv"
# Tool for managing OCI containers and pods
brew "podman"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Symlink manager for dotfiles
brew "stow"
# Cross-shell prompt
brew "starship"
# Safe, concurrent, practical language
brew "rust"
# Tool to build, change, and version infrastructure
brew "hashicorp/tap/terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
brew "goles/battery/battery"
# Command-line interface for 1Password
# Nerd Font (required for icons in eza, starship, neovim)
cask "font-jetbrains-mono-nerd-font"
# Command-line interface for 1Password
cask "1password-cli", args: { appdir: "/Applications" }
# Automatic tiling window manager similar to xmonad
cask "amethyst", args: { appdir: "/Applications" }
# Terminal-based AI coding assistant
cask "claude-code"
# App to build and share containerised applications and microservices
cask "docker-desktop", args: { appdir: "/Applications" }
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { appdir: "/Applications" }
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian", args: { appdir: "/Applications" }
# Archive manager for data compression and backups
cask "rar"
# Team communication and collaboration software
cask "slack", args: { appdir: "/Applications" }
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Video communication and virtual meeting platform
cask "zoom", args: { appdir: "/Applications" }
npm "@google/gemini-cli"
